python/LOTE_421.assinado.xml

<?xml version='1.0' encoding='utf-8'?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <ns0:TesteEnvioLoteNFTSRequest xmlns:ns0="http://www.prefeitura.sp.gov.br/nfts">
      <ns0:VersaoSchema>2</ns0:VersaoSchema>
      <ns0:MensagemXML><![CDATA[<?xml version='1.0' encoding='utf-8'?>
<PedidoEnvioLoteNFTS xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns="http://www.prefeitura.sp.gov.br/nfts"><Cabecalho xmlns="" Versao="1"><Remetente><CPFCNPJ><CNPJ>43643139000166</CNPJ></CPFCNPJ></Remetente><transacao>false</transacao><dtInicio>2025-02-01</dtInicio><dtFim>2025-02-28</dtFim><QtdNFTS>1</QtdNFTS><ValorTotalServicos>54707.56</ValorTotalServicos></Cabecalho><NFTS xmlns=""><TipoDocumento>01</TipoDocumento><ChaveDocumento><InscricaoMunicipal>10259627</InscricaoMunicipal><SerieNFTS>A</SerieNFTS><NumeroDocumento>36898</NumeroDocumento></ChaveDocumento><DataPrestacao>2025-02-04</DataPrestacao><StatusNFTS>N</StatusNFTS><TributacaoNFTS>T</TributacaoNFTS><ValorServicos>54707.56</ValorServicos><ValorDeducoes>0.00</ValorDeducoes><CodigoServico>05312</CodigoServico><CodigoSubItem>0423</CodigoSubItem><AliquotaServicos>0.025</AliquotaServicos><ISSRetidoTomador>false</ISSRetidoTomador><ISSRetidoIntermediario>false</ISSRetidoIntermediario><Prestador><CPFCNPJ><CNPJ>01608379000180</CNPJ></CPFCNPJ><InscricaoMunicipal>10259627</InscricaoMunicipal><RazaoSocialPrestador>UNIMED CENTROOESTE PTAFEDINTCOOP MED</RazaoSocialPrestador><Endereco><TipoLogradouro>Rua</TipoLogradouro><Logradouro>R RIO BRANCO 27</Logradouro><NumeroEndereco>65</NumeroEndereco><Bairro>JD PAULISTA</Bairro><Cidade>BAURU</Cidade><UF>SP</UF><CEP>17017220</CEP></Endereco></Prestador><RegimeTributacao>0</RegimeTributacao><DataPagamento>2025-03-31</DataPagamento><Discriminacao>Atendimentos realizados</Discriminacao><TipoNFTS>2</TipoNFTS><Tomador><CPFCNPJ><CNPJ>43643139000166</CNPJ></CPFCNPJ><RazaoSocial>UNIMED ESTSP FED ESTAD COOP MEDICA</RazaoSocial></Tomador><Assinatura>WzEHyd+jYBaOxulbfQ/SeBJt6fAjk8d/V7GgaAS7HHlPTkvm8sB2Luw7J4XoGjhU4xWQnzyec/7y7Yhbl/7bkbISLd3GdagljY1J/sDgRvRoHVC20XFkQJ3VbJQhAfO6eqNh/4Z+K0YMgftYY8UWyZqCbhCU6qFJ2t+2ZqGfep6IyvEWO5tWU/wAMbL7G6Em4SEa/oFQzjSRPkCguOkKMVq1c4FxGyxzDKXE6qKy6GGq4f7Qx1OT9lJDQgucHTpDPhZMyE6sBOuTy4TVd90HK5KJETsE5Btm3zkrL3rIWeRCBhAPqA55Jfm0/VmEhaw3o69shDmgQshMoGSt1zv3gA==</Assinatura></NFTS><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:SignedInfo>
<ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
<ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
<ds:Reference URI="">
<ds:Transforms>
<ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/>
</ds:Transforms>
<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
<ds:DigestValue>n7t1bJK61l1AkpuGmS2FzEj+qKs=</ds:DigestValue>
</ds:Reference>
</ds:SignedInfo>
<ds:SignatureValue>WZIO0lTVN3GcOQQCJPV6G4zY11hk0zpB5fr359tZ23qFdDtgzT+c/aBb/1Gicltr
cY0gmIDb29PYY/WQHIY9WpIzmoonuKJyFouOLyiuf5/4O+hy/vNmfWqfDUYWk5YG
deLnV5IexpW2P4I0MG+Hhfpo6OMuZwc94EVm5Xe2C+z9rmDByxazSwnC99PQAbtK
A68qPksNrKlzZG2zbnJar5/faMPLsHp62bYTIN3FEY3ov2ootAlfXxR8+P3/JGys
CARyVJ3WtzVlE9T/0nwM4yNdXc8pwq8VhAA/GviChH0axWQmq9UL+Hpwln3XNiOS
ZYzMb3sf31C2pc2Gg1t8SA==</ds:SignatureValue>
<ds:KeyInfo>
<ds:X509Data>
<ds:X509Certificate>MIIIJTCCBg2gAwIBAgIQcclX3XrAmRWmNUSp7HuLZzANBgkqhkiG9w0BAQsFADB4
MQswCQYDVQQGEwJCUjETMBEGA1UEChMKSUNQLUJyYXNpbDE2MDQGA1UECxMtU2Vj
cmV0YXJpYSBkYSBSZWNlaXRhIEZlZGVyYWwgZG8gQnJhc2lsIC0gUkZCMRwwGgYD
VQQDExNBQyBDZXJ0aXNpZ24gUkZCIEc1MB4XDTI1MDYxMjE0NDUzMloXDTI2MDYx
MjE0NDUzMlowggERMQswCQYDVQQGEwJCUjETMBEGA1UECgwKSUNQLUJyYXNpbDEL
MAkGA1UECAwCU1AxEjAQBgNVBAcMCVNhbyBQYXVsbzEZMBcGA1UECwwQVmlkZW9D
b25mZXJlbmNpYTEXMBUGA1UECwwOMjMzMjkwMDAwMDAxMzUxNjA0BgNVBAsMLVNl
Y3JldGFyaWEgZGEgUmVjZWl0YSBGZWRlcmFsIGRvIEJyYXNpbCAtIFJGQjEWMBQG
A1UECwwNUkZCIGUtQ05QSiBBMTFIMEYGA1UEAww/VU5JTUVEIERPIEVTVEFETyBE
RSBTQU8gUEFVTE8gRkVERVJBQ0FPIEVTVEFEVUFMOjQzNjQzMTM5MDAwMTY2MIIB
IjANBgkqhkiG9w0BAQEFAAOCAQ8AMIIBCgKCAQEAvh8NCVmHH987j1jPCukMVvmg
r03kk2KAwvMNSt0h33RyjK+Ged+dJAJMHMAMLb7gsXoGQwzKL4bhlJJOGxwCdj86
b8/MlmT1HRak0r/LuPgRWYYtV7aG52ezt/k2+anZZHcgUgP0rVic3DM0D5ji4JP8
gi5BbrSP89885sQZRlKdbKFtMn5vJhD0mQq+KgYXmiO3b45K3m666KRewLZOWXyi
bu8GojEIVxLDaBUqJSPn/t5kQic4SQom1RXVw1pnw9wvB6QF1j6/0oTQoKOG2F9D
J/MfLNNMsyLn8/q/ZkScOQ0ghJ+sE6DHZAddvebr4nGyHO9VDwEvHBYFyiYUgQID
AQABo4IDDjCCAwowgb0GA1UdEQSBtTCBsqA9BgVgTAEDBKA0BDIyMTA0MTk2MDAy
NzEzMjM0ODU5MDAwMDAwMDAwMDAwMDAwMDAwMDgzMTA5MjVTU1BTUKAhBgVgTAED
AqAYBBZBUk5BTERPIFBBU1NBRklOSSBORVRPoBkGBWBMAQMDoBAEDjQzNjQzMTM5
MDAwMTY2oBcGBWBMAQMHoA4EDDAwMDAwMDAwMDAwMIEaY29tcHJhc0B1bmltZWRm
ZXNwLmNvb3AuYnIwCQYDVR0TBAIwADAfBgNVHSMEGDAWgBRTfX+dvtFh0CC62p/j
iacTc1jNQjB/BgNVHSAEeDB2MHQGBmBMAQIBDDBqMGgGCCsGAQUFBwIBFlxodHRw
Oi8vaWNwLWJyYXNpbC5jZXJ0aXNpZ24uY29tLmJyL3JlcG9zaXRvcmlvL2RwYy9B
Q19DZXJ0aXNpZ25fUkZCL0RQQ19BQ19DZXJ0aXNpZ25fUkZCLnBkZjCBvAYDVR0f
BIG0MIGxMFegVaBThlFodHRwOi8vaWNwLWJyYXNpbC5jZXJ0aXNpZ24uY29tLmJy
L3JlcG9zaXRvcmlvL2xjci9BQ0NlcnRpc2lnblJGQkc1L0xhdGVzdENSTC5jcmww
VqBUoFKGUGh0dHA6Ly9pY3AtYnJhc2lsLm91dHJhbGNyLmNvbS5ici9yZXBvc2l0
b3Jpby9sY3IvQUNDZXJ0aXNpZ25SRkJHNS9MYXRlc3RDUkwuY3JsMA4GA1UdDwEB
/wQEAwIF4DAdBgNVHSUEFjAUBggrBgEFBQcDAgYIKwYBBQUHAwQwgawGCCsGAQUF
BwEBBIGfMIGcMF8GCCsGAQUFBzAChlNodHRwOi8vaWNwLWJyYXNpbC5jZXJ0aXNp
Z24uY29tLmJyL3JlcG9zaXRvcmlvL2NlcnRpZmljYWRvcy9BQ19DZXJ0aXNpZ25f
UkZCX0c1LnA3YzA5BggrBgEFBQcwAYYtaHR0cDovL29jc3AtYWMtY2VydGlzaWdu
LXJmYi5jZXJ0aXNpZ24uY29tLmJyMA0GCSqGSIb3DQEBCwUAA4ICAQAgAZZZvhbW
ReOiAEsrNAaB/YMroOightyj/DlbObZnB48TWsMQ/rLufdxrJjlxOY1gW3HRdZ51
KGauwdiDau7oaRtnSo9D14DPGlSjnxWjuxoKOsyp0dpQ90WRqR2i2BS5j+d93QUi
RyzJgAxnm79u0m9VHH2HCKaRC898OvTqY5rvLgbRAaOZd8hPWDpLxn+S08b1+dAo
CbcdzupzSJPoaAE6o9SX3fkrH1AeAu3Et0GX+UT0mDdyEy1Mrog5a2NLf5ZIC1wD
Vtnq8sf2MYxXD6J8edc9Hg1IIHtm4Ntsi2lRDzLNXiUmicWzKyAjHAc6vnCynPRK
Up1NP4Hm5ViV/E0RrsIO74xkXHahkxBlQuGeOGGF/6ellAsBkGdLD9ynLscrOdaA
Gc4f0XcV+LBkGB54n1iwX0M6Dk2W3MT45z1ciQKE54BKf5TS0G+98gl8lpuW1xl3
VKRv6coGtLOm+cQNWr1Xb2h5y6JoU2H0l8Tcrn86B79o7Lovs45mukEhnH2t1Akc
VLEttf8FmaL+dPX683ImFFr6es30Gwoz8KA9DMkDHaH4+zzJFhcfqwMPoqk/P++x
QhoPMoxvRvfrTndflQEcLOHsqXkvuRbCxA+a866YfsKNvgSE9Lfu4QcuuxWnPjTj
bQinEXlGFtJIPBC9oyS8PrIATnNi5BYSfw==
</ds:X509Certificate>
</ds:X509Data>
</ds:KeyInfo>
</ds:Signature></PedidoEnvioLoteNFTS>]]></ns0:MensagemXML>
    </ns0:TesteEnvioLoteNFTSRequest>
  </soap:Body>
</soap:Envelope>
